// Объект с шаблонами сопроводительных писем
export const TEMPLATES = {
  coverLetter_1: `Здравствуйте, {#companyName}! Меня зовут Андрей и ваша вакансия заинтересовала меня!

Вкратце о себе: Опыт работы в коммерции составляет 4,8 года. Работал в нескольких компаниях, участвовал в интересных проектах. Ниже опишу, что делал и с чем работал.

Основной стек, с которым я работал: React (4,5 года), TypeScript (3,5 года), Redux / MobX (4 года), Jest / Cypress (2,5 года), Vite / Webpack (4,3 года).

Разрабатывал платежную систему для финансовой организации и интегрировал её в систему. Также был опыт работы с системой единой аутентификации, конструктором лендингов, дашбордами курсов валют, B2B-личными кабинетами и ERP-системами.

Мой архитектурный опыт: публикацию npm-пакетов для переиспользования между проектами, внедрение Feature-Sliced Design, оптимизацию монолитного репозитория, создание доменной архитектуры. 

Проводил миграции с REST API на GraphQL, с Redux на Zustand / MobX, с Apollo Client на React Query. Переписывал классовые компоненты на функциональные. Занимался настройкой CI/CD.

Текущий проект — разработка системы мониторинга буровых нефтегазовых установок с визуализацией больших данных в реальном времени (GraphQL, Chart.js, D3, WebSocket, Redux Saga).

Почта: karlinandrey38@gmail.com
Telegram: @grokhemm`,
  coverLetter_2: '.',
  coverLetter_3: '',
  coverLetter_4: '',
  coverLetter_5: '',
};
